eclipse-threadx/getting-started/SiliconLabs/EFR32MG12/lib/gecko_sdk_3.0.0_efr32mg12/platform/emlib/src/em_opamp.c
/*******************************************************************************
 **************************   GLOBAL FUNCTIONS   *******************************
 ******************************************************************************/

/***************************************************************************//**
 * @brief
 *   Disable an Operational Amplifier.
 *
 * @if DOXYDOC_P1_DEVICE
 * @param[in] dac
 *   A pointer to the DAC peripheral register block.
 * @elseif DOXYDOC_P2_DEVICE
 * @param[in] dac
 *   A pointer to the VDAC peripheral register block.
 * @endif
 *
 * @param[in] opa
 *   Selects an OPA, valid values are OPA0, OPA1, and OPA2.
 ******************************************************************************/
void OPAMP_Disable(
#if defined(_SILICON_LABS_32B_SERIES_0)
  DAC_TypeDef *dac,
#elif defined(_SILICON_LABS_32B_SERIES_1)
  VDAC_TypeDef *dac,
#endif
  OPAMP_TypeDef opa)
{
#if defined(_SILICON_LABS_32B_SERIES_0)
  EFM_ASSERT(DAC_REF_VALID(dac));
  EFM_ASSERT(DAC_OPA_VALID(opa));

  if (opa == OPA0) {
    dac->CH0CTRL &= ~DAC_CH0CTRL_EN;
    dac->OPACTRL &= ~DAC_OPACTRL_OPA0EN;
  } else if (opa == OPA1) {
    dac->CH1CTRL &= ~DAC_CH1CTRL_EN;
    dac->OPACTRL &= ~DAC_OPACTRL_OPA1EN;
  } else { /* OPA2 */
    dac->OPACTRL &= ~DAC_OPACTRL_OPA2EN;
  }

#elif defined(_SILICON_LABS_32B_SERIES_1)
  EFM_ASSERT(VDAC_REF_VALID(dac));
  EFM_ASSERT(VDAC_OPA_VALID(opa));

  if (opa == OPA0) {
#if defined(VDAC_STATUS_OPA0ENS)
    dac->CMD |= VDAC_CMD_OPA0DIS;
    while (dac->STATUS & VDAC_STATUS_OPA0ENS) {
    }
#endif
#if defined(VDAC_STATUS_OPA1ENS)
  } else if (opa == OPA1) {
    dac->CMD |= VDAC_CMD_OPA1DIS;
    while (dac->STATUS & VDAC_STATUS_OPA1ENS) {
    }
#endif
#if defined(VDAC_STATUS_OPA2ENS)
  } else if (opa == OPA2) {
    dac->CMD |= VDAC_CMD_OPA2DIS;
    while (dac->STATUS & VDAC_STATUS_OPA2ENS) {
    }
#endif
  } else { /* OPA3 */
#if defined(VDAC_STATUS_OPA3ENS)
    dac->CMD |= VDAC_CMD_OPA3DIS;
    while (dac->STATUS & VDAC_STATUS_OPA3ENS) {
    }
#endif
  }
#endif
}

/***************************************************************************//**
 * @brief
 *   Configure and enable an Operational Amplifier.
 *
 * @if DOXYDOC_P1_DEVICE
 * @note
 *   The value of the alternate output enable bit mask in the OPAMP_Init_TypeDef
 *   structure should consist of one or more of the
 *   DAC_OPA[opa#]MUX_OUTPEN_OUT[output#] flags
 *   (defined in \<part_name\>_dac.h) OR'ed together. @n @n
 *   For OPA0:
 *   @li DAC_OPA0MUX_OUTPEN_OUT0
 *   @li DAC_OPA0MUX_OUTPEN_OUT1
 *   @li DAC_OPA0MUX_OUTPEN_OUT2
 *   @li DAC_OPA0MUX_OUTPEN_OUT3
 *   @li DAC_OPA0MUX_OUTPEN_OUT4
 *
 *   For OPA1:
 *   @li DAC_OPA1MUX_OUTPEN_OUT0
 *   @li DAC_OPA1MUX_OUTPEN_OUT1
 *   @li DAC_OPA1MUX_OUTPEN_OUT2
 *   @li DAC_OPA1MUX_OUTPEN_OUT3
 *   @li DAC_OPA1MUX_OUTPEN_OUT4
 *
 *   For OPA2:
 *   @li DAC_OPA2MUX_OUTPEN_OUT0
 *   @li DAC_OPA2MUX_OUTPEN_OUT1
 *
 *   E.g: @n
 *   init.outPen = DAC_OPA0MUX_OUTPEN_OUT0 | DAC_OPA0MUX_OUTPEN_OUT4;
 *
 * @param[in] dac
 *   A pointer to the DAC peripheral register block.
 * @elseif DOXYDOC_P2_DEVICE
 * @note
 *   The value of the alternate output enable bit mask in the OPAMP_Init_TypeDef
 *   structure should consist of one or more of the
 *   VDAC_OPA_OUT_ALTOUTPADEN_OUT[output#] flags
 *   (defined in \<part_name\>_vdac.h) OR'ed together. @n @n
 *   @li VDAC_OPA_OUT_ALTOUTPADEN_OUT0
 *   @li VDAC_OPA_OUT_ALTOUTPADEN_OUT1
 *   @li VDAC_OPA_OUT_ALTOUTPADEN_OUT2
 *   @li VDAC_OPA_OUT_ALTOUTPADEN_OUT3
 *   @li VDAC_OPA_OUT_ALTOUTPADEN_OUT4
 *
 *   For example: @n
 *   init.outPen = VDAC_OPA_OUT_ALTOUTPADEN_OUT0 | VDAC_OPA_OUT_ALTOUTPADEN_OUT4;
 * @param[in] dac
 *   A pointer to the VDAC peripheral register block.
 * @endif
 *
 * @param[in] opa
 *   Selects an OPA, valid values are OPA0, OPA1, and OPA2.
 *
 * @param[in] init
 *   A pointer to a structure containing OPAMP initialization information.
 ******************************************************************************/
void OPAMP_Enable(
#if defined(_SILICON_LABS_32B_SERIES_0)
  DAC_TypeDef *dac,
#elif defined(_SILICON_LABS_32B_SERIES_1)
  VDAC_TypeDef *dac,
#endif
  OPAMP_TypeDef opa,
  const OPAMP_Init_TypeDef *init)
{
#if defined(_SILICON_LABS_32B_SERIES_0)
  uint32_t gain;

  EFM_ASSERT(DAC_REF_VALID(dac));
  EFM_ASSERT(DAC_OPA_VALID(opa));
  EFM_ASSERT(init->bias <= (_DAC_BIASPROG_BIASPROG_MASK
                            >> _DAC_BIASPROG_BIASPROG_SHIFT));

  if (opa == OPA0) {
    EFM_ASSERT((init->outPen & ~_DAC_OPA0MUX_OUTPEN_MASK) == 0);

    dac->BIASPROG = (dac->BIASPROG
                     & ~(_DAC_BIASPROG_BIASPROG_MASK
                         | DAC_BIASPROG_HALFBIAS))
                    | (init->bias     << _DAC_BIASPROG_BIASPROG_SHIFT)
                    | (init->halfBias ?   DAC_BIASPROG_HALFBIAS : 0);

    if (init->defaultOffset) {
      gain = dac->CAL & _DAC_CAL_GAIN_MASK;
      SYSTEM_GetCalibrationValue(&dac->CAL);
      dac->CAL = (dac->CAL & ~_DAC_CAL_GAIN_MASK) | gain;
    } else {
      EFM_ASSERT(init->offset <= (_DAC_CAL_CH0OFFSET_MASK
                                  >> _DAC_CAL_CH0OFFSET_SHIFT));

      dac->CAL = (dac->CAL & ~_DAC_CAL_CH0OFFSET_MASK)
                 | (init->offset << _DAC_CAL_CH0OFFSET_SHIFT);
    }

    dac->OPA0MUX  = (uint32_t)init->resSel
                    | (uint32_t)init->outMode
                    | init->outPen
                    | (uint32_t)init->resInMux
                    | (uint32_t)init->negSel
                    | (uint32_t)init->posSel
                    | (init->nextOut ? DAC_OPA0MUX_NEXTOUT : 0)
                    | (init->npEn    ? DAC_OPA0MUX_NPEN    : 0)
                    | (init->ppEn    ? DAC_OPA0MUX_PPEN    : 0);

    dac->CH0CTRL |= DAC_CH0CTRL_EN;
    dac->OPACTRL  = (dac->OPACTRL
                     & ~(DAC_OPACTRL_OPA0SHORT
                         | _DAC_OPACTRL_OPA0LPFDIS_MASK
                         |  DAC_OPACTRL_OPA0HCMDIS))
                    | (init->shortInputs ?  DAC_OPACTRL_OPA0SHORT : 0)
                    | (init->lpfPosPadDisable
                       ? DAC_OPACTRL_OPA0LPFDIS_PLPFDIS : 0)
                    | (init->lpfNegPadDisable
                       ? DAC_OPACTRL_OPA0LPFDIS_NLPFDIS : 0)
                    | (init->hcmDisable ? DAC_OPACTRL_OPA0HCMDIS : 0)
                    | DAC_OPACTRL_OPA0EN;
  } else if ( opa == OPA1 ) {
    EFM_ASSERT((init->outPen & ~_DAC_OPA1MUX_OUTPEN_MASK) == 0);

    dac->BIASPROG = (dac->BIASPROG
                     & ~(_DAC_BIASPROG_BIASPROG_MASK
                         | DAC_BIASPROG_HALFBIAS))
                    | (init->bias   << _DAC_BIASPROG_BIASPROG_SHIFT)
                    | (init->halfBias ? DAC_BIASPROG_HALFBIAS : 0);

    if (init->defaultOffset) {
      gain = dac->CAL & _DAC_CAL_GAIN_MASK;
      SYSTEM_GetCalibrationValue(&dac->CAL);
      dac->CAL = (dac->CAL & ~_DAC_CAL_GAIN_MASK) | gain;
    } else {
      EFM_ASSERT(init->offset <= (_DAC_CAL_CH1OFFSET_MASK
                                  >> _DAC_CAL_CH1OFFSET_SHIFT));

      dac->CAL = (dac->CAL & ~_DAC_CAL_CH1OFFSET_MASK)
                 | (init->offset << _DAC_CAL_CH1OFFSET_SHIFT);
    }

    dac->OPA1MUX  = (uint32_t)init->resSel
                    | (uint32_t)init->outMode
                    | init->outPen
                    | (uint32_t)init->resInMux
                    | (uint32_t)init->negSel
                    | (uint32_t)init->posSel
                    | (init->nextOut ? DAC_OPA1MUX_NEXTOUT : 0)
                    | (init->npEn    ? DAC_OPA1MUX_NPEN    : 0)
                    | (init->ppEn    ? DAC_OPA1MUX_PPEN    : 0);

