eclipse-threadx/getting-started/SiliconLabs/EFR32MG12/lib/gecko_sdk_3.0.0_efr32mg12/platform/emlib/src/em_opamp.c
    case opaDrvStrHighAccHighStr:
      warmupTime = 8;
      break;

    case opaDrvStrLowAccLowStr:
      warmupTime = 85;
      break;

    case opaDrvStrLowerAccLowStr:
    default:
      warmupTime = 100;
      break;
  }

  dac->OPA[opa].TIMER = (uint32_t)(init->settleTime
                                   << _VDAC_OPA_TIMER_SETTLETIME_SHIFT)
                        | (uint32_t)(warmupTime
                                     << _VDAC_OPA_TIMER_WARMUPTIME_SHIFT)
                        | (uint32_t)(init->startupDly
                                     << _VDAC_OPA_TIMER_STARTUPDLY_SHIFT);

  dac->OPA[opa].CTRL  = (init->aportYMasterDisable
                         ? VDAC_OPA_CTRL_APORTYMASTERDIS : 0)
                        | (init->aportXMasterDisable
                           ? VDAC_OPA_CTRL_APORTXMASTERDIS : 0)
                        | (uint32_t)init->prsOutSel
                        | (uint32_t)init->prsSel
                        | (uint32_t)init->prsMode
                        | (init->prsEn ? VDAC_OPA_CTRL_PRSEN : 0)
                        | (init->halfDrvStr
                           ? VDAC_OPA_CTRL_OUTSCALE_HALF
                           : VDAC_OPA_CTRL_OUTSCALE_FULL)
                        | (init->hcmDisable ? VDAC_OPA_CTRL_HCMDIS : 0)
                        | (init->ugBwScale ? VDAC_OPA_CTRL_INCBW : 0)
                        | (uint32_t)init->drvStr;

  if (opa == OPA0) {
#if defined(VDAC_STATUS_OPA0ENS)
    dac->CMD |= VDAC_CMD_OPA0EN;
#endif
#if defined(VDAC_STATUS_OPA1ENS)
  } else if (opa == OPA1) {
    dac->CMD |= VDAC_CMD_OPA1EN;
#endif
#if defined(VDAC_STATUS_OPA2ENS)
  } else if (opa == OPA2) {
    dac->CMD |= VDAC_CMD_OPA2EN;
#endif
#if defined(VDAC_STATUS_OPA3ENS)
  } else { /* OPA3 */
    dac->CMD |= VDAC_CMD_OPA3EN;
#endif
  }

#endif
}

/** @} (end addtogroup opamp) */

#endif /* (defined(OPAMP_PRESENT) && (OPAMP_COUNT == 1)
       || defined(VDAC_PRESENT) && (VDAC_COUNT > 0) */
